app/controllers/tweets_controller.rb

SELECT "tweets".* FROM "tweets"
---
    def index
     tweets = Tweet.all

SELECT "tweets".* FROM "tweets" WHERE "tweets"."id" = ? LIMIT ?  [["id", 10], ["LIMIT", 1]]
---
    def show
     tweet = Tweet.find(params[:id])

INSERT INTO "tweets" ("title", "content", "author", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)
---
    def create
      tweet = Tweet.new(tweet_params)

      if tweet.save